{
  "common": {
    "error": "Fehler",
    "edit": "Bearbeiten",
    "delete": "Löschen",
    "ok": "Ok",
    "cancel": "Abbrechen",
    "done": "Fertig",
    "yes": "Ja",
    "no": "Nein"
  },
  "user": {
    "registration": {
      "title": "Registrierung",
      "email": { "textfield": { "hint": "E-Mail" } },
      "password": { "textfield": { "hint": "Passwort" } },
      "display_name": { "textfield": { "hint": "Benutzername" } },
      "already_registered": {
        "message": "Bereits angemeldet? Dann gehe direkt zum Login.",
        "hyperlink": "Login"
      },
      "register": "Registrieren"
    },
    "login": {
      "title": "Login",
      "email": { "textfield": { "hint": "E-Mail" } },
      "password": { "textfield": { "hint": "Passwort" } },
      "not_registered": {
        "message": "Nocht nicht angemeldet? Dann registriere dich jetzt.",
        "hyperlink": "registriere"
      },
      "login": "Login"
    },
    "profile": {
      "title": "Profil",
      "user_id": "UserId",
      "email": "E-Mail",
      "display_name": "Benutzername",
      "logout": "Logout"
    },
    "error": {
      "invalid_email": "Die angegebene E-Mail-Adresse ist nicht gültig",
      "email_already_in_use": "Die angegebene E-Mail-Adresse wird bereits verwendet",
      "operation_not_allowed": "Die Möglichkeit zum Registrieren / Einloggen ist derzeit nicht aktiviert",
      "weak_password": "Das angegebene Passwort ist zu schwach. Bitte verwende mindestens 6 Zeichen",
      "user_disabled": "Der Account wurde vorübergehend deaktiviert",
      "user_not_found": "Zu der angegeben E-Mail-Adresse wurde kein Konto gefunden",
      "wrong_password": "Das angegebene Passwort ist nicht korrekt",
      "display_name_too_short": "Der angegebene Benutzername ist zu kurz. Bitte verwende mindestens 3 Zeichen"
    }
  },
  "recipe_overview": {
    "title": "Rezeptübersicht",
    "add": {
      "dialog": {
        "title": "Neues Rezept",
        "textfield": { "hint": "Rezeptname" }
      },
      "button": { "hint": "Rezept hinzufügen" }
    }
  },
  "recipe_details": {
    "heading": {
      "ingredients": "Zutaten",
      "preparation": "Zubereitung"
    },
    "delete": {
      "dialog": {
        "title": "Rezept löschen",
        "info": "Bist du dir sicher, dass du das Rezept komplett löschen möchtest?"
      }
    },
    "edit_mode": {
      "discard_changes": {
        "dialog": {
          "title": "Änderungen verwerfen",
          "info": "Bist du dir sicher, dass du alle Änderungen verwerfen möchtest?"
        }
      },
      "usage": {
        "ingredient_unit": { "dropdown": { "hint": "Einheit auswählen" } },
        "ingredient": { "dropdown": { "hint": "Zutat auswählen" } }
      },
      "step": {
        "textfield": { "hint": "Beschreibe den nächsten Schritt" }
      }
    },
    "step_number": "Schritt {stepNumber}"
  },
  "ingredients": {
    "title": "Zutaten",
    "add": {
      "textfield": { "hint": "Füge eine neue Zutat hinzu" }
    }
  },
  "ingredient_units": {
    "title": "Einheiten",
    "add": {
      "textfield": { "hint": "Füge eine neue Einheit hinzu" }
    }
  },
  "error_codes": {
    "10": "Der Server konnte nicht erreicht werden",
    "20": "Eine der Zutaten im Rezept ist nicht vollständig",
    "100": "Es existiert bereits ein Rezept mit diesem Namen",
    "120": "Das Rezept konnte nicht gelöscht werden da es nicht gefunden wurde",
    "121": "Das Rezept konnte aus unbekannten Gründen nicht gelöscht werden",
    "130": "Der Zubereitungsschritt konnte nicht erstellt werden da das Rezept nicht mehr gefunden wurde",
    "135": "Der Zubereitungsschritt konnte nicht aktualisiert werden da der Schritt nicht mehr gefunden wurde",
    "140": "Der Zubereitungsschritt konnte nicht gelöscht werden da der Schritt nicht mehr gefunden wurde",
    "141": "Der Zubereitungsschritt konnte aus unbekannten Gründen nicht gelöscht werden",
    "200": "Die Zutat konnte nicht erstellt werden da bereits eine Zutat mit diesem Namen existiert",
    "220": "Die Zutat konnte nicht gelöscht werden da sie nicht gefunden wurde",
    "221": "Die Zutat konnte aus unbekannten Gründen nicht gelöscht werden",
    "222": "Die Zutat konnte nicht gelöscht werden da sie noch in Rezepten benutzt wird",
    "300": "Die Einheit konnte nicht erstellt werden da bereits eine Einheit mit diesem Namen existiert",
    "320": "Die Einheit konnte aus unbekannten Gründen nicht gelöscht werden",
    "321": "Die Einheit konnte nicht gelöscht werden da sie nicht gefunden wurde",
    "322": "Die Einheit konnte nicht gelöscht werden da sie noch in Rezepten benutzt wird",
    "400": "Die Zutat konnte nicht dem Rezept hinzugefügt werden da sie nicht gefunden wurde",
    "401": "Die Zutat konnte nicht dem Rezept hinzugefügt werden da die Einheit nicht gefunden wurde",
    "402": "Die Zutat konnte nicht dem Rezept hinzugefügt werden da das Rezept nicht mehr gefunden wurde",
    "403": "Die Zutat konnte nicht dem Rezept hinzugefügt werden da sie bereits in dem Rezept verwendet wird",
    "410": "Die Zutat im Rezept konnte nicht aktualisiert werden da die Zutatenbenutzung nicht gefunden wurde",
    "411": "Die Zutat im Rezept konnte nicht aktualisiert werden da die neue Zutat nicht gefunden wurde",
    "412": "Die Zutat im Rezept konnte nicht aktualisiert werden da die neue Einheit nicht gefunden wurde",
    "413": "Die Zutat im Rezept konnte nicht aktualisiert werden da das Rezept nicht mehr gefunden wurde",
    "414": "Die Zutat im Rezept konnte nicht aktualisiert werden da sie bereits in dem Rezept benutzt wird",
    "420": "Die Zutat konnte nicht aus dem Rezept gelöscht werden da die Benutzung nicht gefunden wurde",
    "421": "Die Zutat konnte aus unbekannten Gründen nicht aus dem Rezept gelöscht werden"
  }
}
